espressif/esp-idf/components/soc/esp32c6/register/soc/sdio_slc_reg.h
/** SDIO_SLC1INT_ST1_REG register
 *  reserved
 */
#define SDIO_SLC1INT_ST1_REG (DR_REG_SLC_BASE + 0x14c)
/** SDIO_SLC_FRHOST_BIT8_INT_ST1 : RO; bitpos: [0]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT8_INT_ST1    (BIT(0))
#define SDIO_SLC_FRHOST_BIT8_INT_ST1_M  (SDIO_SLC_FRHOST_BIT8_INT_ST1_V << SDIO_SLC_FRHOST_BIT8_INT_ST1_S)
#define SDIO_SLC_FRHOST_BIT8_INT_ST1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT8_INT_ST1_S  0
/** SDIO_SLC_FRHOST_BIT9_INT_ST1 : RO; bitpos: [1]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT9_INT_ST1    (BIT(1))
#define SDIO_SLC_FRHOST_BIT9_INT_ST1_M  (SDIO_SLC_FRHOST_BIT9_INT_ST1_V << SDIO_SLC_FRHOST_BIT9_INT_ST1_S)
#define SDIO_SLC_FRHOST_BIT9_INT_ST1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT9_INT_ST1_S  1
/** SDIO_SLC_FRHOST_BIT10_INT_ST1 : RO; bitpos: [2]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT10_INT_ST1    (BIT(2))
#define SDIO_SLC_FRHOST_BIT10_INT_ST1_M  (SDIO_SLC_FRHOST_BIT10_INT_ST1_V << SDIO_SLC_FRHOST_BIT10_INT_ST1_S)
#define SDIO_SLC_FRHOST_BIT10_INT_ST1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT10_INT_ST1_S  2
/** SDIO_SLC_FRHOST_BIT11_INT_ST1 : RO; bitpos: [3]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT11_INT_ST1    (BIT(3))
#define SDIO_SLC_FRHOST_BIT11_INT_ST1_M  (SDIO_SLC_FRHOST_BIT11_INT_ST1_V << SDIO_SLC_FRHOST_BIT11_INT_ST1_S)
#define SDIO_SLC_FRHOST_BIT11_INT_ST1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT11_INT_ST1_S  3
/** SDIO_SLC_FRHOST_BIT12_INT_ST1 : RO; bitpos: [4]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT12_INT_ST1    (BIT(4))
#define SDIO_SLC_FRHOST_BIT12_INT_ST1_M  (SDIO_SLC_FRHOST_BIT12_INT_ST1_V << SDIO_SLC_FRHOST_BIT12_INT_ST1_S)
#define SDIO_SLC_FRHOST_BIT12_INT_ST1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT12_INT_ST1_S  4
/** SDIO_SLC_FRHOST_BIT13_INT_ST1 : RO; bitpos: [5]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT13_INT_ST1    (BIT(5))
#define SDIO_SLC_FRHOST_BIT13_INT_ST1_M  (SDIO_SLC_FRHOST_BIT13_INT_ST1_V << SDIO_SLC_FRHOST_BIT13_INT_ST1_S)
#define SDIO_SLC_FRHOST_BIT13_INT_ST1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT13_INT_ST1_S  5
/** SDIO_SLC_FRHOST_BIT14_INT_ST1 : RO; bitpos: [6]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT14_INT_ST1    (BIT(6))
#define SDIO_SLC_FRHOST_BIT14_INT_ST1_M  (SDIO_SLC_FRHOST_BIT14_INT_ST1_V << SDIO_SLC_FRHOST_BIT14_INT_ST1_S)
#define SDIO_SLC_FRHOST_BIT14_INT_ST1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT14_INT_ST1_S  6
/** SDIO_SLC_FRHOST_BIT15_INT_ST1 : RO; bitpos: [7]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT15_INT_ST1    (BIT(7))
#define SDIO_SLC_FRHOST_BIT15_INT_ST1_M  (SDIO_SLC_FRHOST_BIT15_INT_ST1_V << SDIO_SLC_FRHOST_BIT15_INT_ST1_S)
#define SDIO_SLC_FRHOST_BIT15_INT_ST1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT15_INT_ST1_S  7
/** SDIO_SLC1_RX_START_INT_ST1 : RO; bitpos: [8]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_START_INT_ST1    (BIT(8))
#define SDIO_SLC1_RX_START_INT_ST1_M  (SDIO_SLC1_RX_START_INT_ST1_V << SDIO_SLC1_RX_START_INT_ST1_S)
#define SDIO_SLC1_RX_START_INT_ST1_V  0x00000001U
#define SDIO_SLC1_RX_START_INT_ST1_S  8
/** SDIO_SLC1_TX_START_INT_ST1 : RO; bitpos: [9]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_START_INT_ST1    (BIT(9))
#define SDIO_SLC1_TX_START_INT_ST1_M  (SDIO_SLC1_TX_START_INT_ST1_V << SDIO_SLC1_TX_START_INT_ST1_S)
#define SDIO_SLC1_TX_START_INT_ST1_V  0x00000001U
#define SDIO_SLC1_TX_START_INT_ST1_S  9
/** SDIO_SLC1_RX_UDF_INT_ST1 : RO; bitpos: [10]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_UDF_INT_ST1    (BIT(10))
#define SDIO_SLC1_RX_UDF_INT_ST1_M  (SDIO_SLC1_RX_UDF_INT_ST1_V << SDIO_SLC1_RX_UDF_INT_ST1_S)
#define SDIO_SLC1_RX_UDF_INT_ST1_V  0x00000001U
#define SDIO_SLC1_RX_UDF_INT_ST1_S  10
/** SDIO_SLC1_TX_OVF_INT_ST1 : RO; bitpos: [11]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_OVF_INT_ST1    (BIT(11))
#define SDIO_SLC1_TX_OVF_INT_ST1_M  (SDIO_SLC1_TX_OVF_INT_ST1_V << SDIO_SLC1_TX_OVF_INT_ST1_S)
#define SDIO_SLC1_TX_OVF_INT_ST1_V  0x00000001U
#define SDIO_SLC1_TX_OVF_INT_ST1_S  11
/** SDIO_SLC1_TOKEN0_1TO0_INT_ST1 : RO; bitpos: [12]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN0_1TO0_INT_ST1    (BIT(12))
#define SDIO_SLC1_TOKEN0_1TO0_INT_ST1_M  (SDIO_SLC1_TOKEN0_1TO0_INT_ST1_V << SDIO_SLC1_TOKEN0_1TO0_INT_ST1_S)
#define SDIO_SLC1_TOKEN0_1TO0_INT_ST1_V  0x00000001U
#define SDIO_SLC1_TOKEN0_1TO0_INT_ST1_S  12
/** SDIO_SLC1_TOKEN1_1TO0_INT_ST1 : RO; bitpos: [13]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN1_1TO0_INT_ST1    (BIT(13))
#define SDIO_SLC1_TOKEN1_1TO0_INT_ST1_M  (SDIO_SLC1_TOKEN1_1TO0_INT_ST1_V << SDIO_SLC1_TOKEN1_1TO0_INT_ST1_S)
#define SDIO_SLC1_TOKEN1_1TO0_INT_ST1_V  0x00000001U
#define SDIO_SLC1_TOKEN1_1TO0_INT_ST1_S  13
/** SDIO_SLC1_TX_DONE_INT_ST1 : RO; bitpos: [14]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_DONE_INT_ST1    (BIT(14))
#define SDIO_SLC1_TX_DONE_INT_ST1_M  (SDIO_SLC1_TX_DONE_INT_ST1_V << SDIO_SLC1_TX_DONE_INT_ST1_S)
#define SDIO_SLC1_TX_DONE_INT_ST1_V  0x00000001U
#define SDIO_SLC1_TX_DONE_INT_ST1_S  14
/** SDIO_SLC1_TX_SUC_EOF_INT_ST1 : RO; bitpos: [15]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_SUC_EOF_INT_ST1    (BIT(15))
#define SDIO_SLC1_TX_SUC_EOF_INT_ST1_M  (SDIO_SLC1_TX_SUC_EOF_INT_ST1_V << SDIO_SLC1_TX_SUC_EOF_INT_ST1_S)
#define SDIO_SLC1_TX_SUC_EOF_INT_ST1_V  0x00000001U
#define SDIO_SLC1_TX_SUC_EOF_INT_ST1_S  15
/** SDIO_SLC1_RX_DONE_INT_ST1 : RO; bitpos: [16]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_DONE_INT_ST1    (BIT(16))
#define SDIO_SLC1_RX_DONE_INT_ST1_M  (SDIO_SLC1_RX_DONE_INT_ST1_V << SDIO_SLC1_RX_DONE_INT_ST1_S)
#define SDIO_SLC1_RX_DONE_INT_ST1_V  0x00000001U
#define SDIO_SLC1_RX_DONE_INT_ST1_S  16
/** SDIO_SLC1_RX_EOF_INT_ST1 : RO; bitpos: [17]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_EOF_INT_ST1    (BIT(17))
#define SDIO_SLC1_RX_EOF_INT_ST1_M  (SDIO_SLC1_RX_EOF_INT_ST1_V << SDIO_SLC1_RX_EOF_INT_ST1_S)
#define SDIO_SLC1_RX_EOF_INT_ST1_V  0x00000001U
#define SDIO_SLC1_RX_EOF_INT_ST1_S  17
/** SDIO_SLC1_TOHOST_INT_ST1 : RO; bitpos: [18]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOHOST_INT_ST1    (BIT(18))
#define SDIO_SLC1_TOHOST_INT_ST1_M  (SDIO_SLC1_TOHOST_INT_ST1_V << SDIO_SLC1_TOHOST_INT_ST1_S)
#define SDIO_SLC1_TOHOST_INT_ST1_V  0x00000001U
#define SDIO_SLC1_TOHOST_INT_ST1_S  18
/** SDIO_SLC1_TX_DSCR_ERR_INT_ST1 : RO; bitpos: [19]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_DSCR_ERR_INT_ST1    (BIT(19))
#define SDIO_SLC1_TX_DSCR_ERR_INT_ST1_M  (SDIO_SLC1_TX_DSCR_ERR_INT_ST1_V << SDIO_SLC1_TX_DSCR_ERR_INT_ST1_S)
#define SDIO_SLC1_TX_DSCR_ERR_INT_ST1_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_ERR_INT_ST1_S  19
/** SDIO_SLC1_RX_DSCR_ERR_INT_ST1 : RO; bitpos: [20]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_DSCR_ERR_INT_ST1    (BIT(20))
#define SDIO_SLC1_RX_DSCR_ERR_INT_ST1_M  (SDIO_SLC1_RX_DSCR_ERR_INT_ST1_V << SDIO_SLC1_RX_DSCR_ERR_INT_ST1_S)
#define SDIO_SLC1_RX_DSCR_ERR_INT_ST1_V  0x00000001U
#define SDIO_SLC1_RX_DSCR_ERR_INT_ST1_S  20
/** SDIO_SLC1_TX_DSCR_EMPTY_INT_ST1 : RO; bitpos: [21]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ST1    (BIT(21))
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ST1_M  (SDIO_SLC1_TX_DSCR_EMPTY_INT_ST1_V << SDIO_SLC1_TX_DSCR_EMPTY_INT_ST1_S)
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ST1_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ST1_S  21
/** SDIO_SLC1_HOST_RD_ACK_INT_ST1 : RO; bitpos: [22]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_HOST_RD_ACK_INT_ST1    (BIT(22))
#define SDIO_SLC1_HOST_RD_ACK_INT_ST1_M  (SDIO_SLC1_HOST_RD_ACK_INT_ST1_V << SDIO_SLC1_HOST_RD_ACK_INT_ST1_S)
#define SDIO_SLC1_HOST_RD_ACK_INT_ST1_V  0x00000001U
#define SDIO_SLC1_HOST_RD_ACK_INT_ST1_S  22
/** SDIO_SLC1_WR_RETRY_DONE_INT_ST1 : RO; bitpos: [23]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_WR_RETRY_DONE_INT_ST1    (BIT(23))
#define SDIO_SLC1_WR_RETRY_DONE_INT_ST1_M  (SDIO_SLC1_WR_RETRY_DONE_INT_ST1_V << SDIO_SLC1_WR_RETRY_DONE_INT_ST1_S)
#define SDIO_SLC1_WR_RETRY_DONE_INT_ST1_V  0x00000001U
#define SDIO_SLC1_WR_RETRY_DONE_INT_ST1_S  23
/** SDIO_SLC1_TX_ERR_EOF_INT_ST1 : RO; bitpos: [24]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_ERR_EOF_INT_ST1    (BIT(24))
#define SDIO_SLC1_TX_ERR_EOF_INT_ST1_M  (SDIO_SLC1_TX_ERR_EOF_INT_ST1_V << SDIO_SLC1_TX_ERR_EOF_INT_ST1_S)
#define SDIO_SLC1_TX_ERR_EOF_INT_ST1_V  0x00000001U
#define SDIO_SLC1_TX_ERR_EOF_INT_ST1_S  24

/** SDIO_SLC1INT_ENA1_REG register
 *  reserved
 */
#define SDIO_SLC1INT_ENA1_REG (DR_REG_SLC_BASE + 0x150)
/** SDIO_SLC_FRHOST_BIT8_INT_ENA1 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT8_INT_ENA1    (BIT(0))
#define SDIO_SLC_FRHOST_BIT8_INT_ENA1_M  (SDIO_SLC_FRHOST_BIT8_INT_ENA1_V << SDIO_SLC_FRHOST_BIT8_INT_ENA1_S)
#define SDIO_SLC_FRHOST_BIT8_INT_ENA1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT8_INT_ENA1_S  0
/** SDIO_SLC_FRHOST_BIT9_INT_ENA1 : R/W; bitpos: [1]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT9_INT_ENA1    (BIT(1))
#define SDIO_SLC_FRHOST_BIT9_INT_ENA1_M  (SDIO_SLC_FRHOST_BIT9_INT_ENA1_V << SDIO_SLC_FRHOST_BIT9_INT_ENA1_S)
#define SDIO_SLC_FRHOST_BIT9_INT_ENA1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT9_INT_ENA1_S  1
/** SDIO_SLC_FRHOST_BIT10_INT_ENA1 : R/W; bitpos: [2]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT10_INT_ENA1    (BIT(2))
#define SDIO_SLC_FRHOST_BIT10_INT_ENA1_M  (SDIO_SLC_FRHOST_BIT10_INT_ENA1_V << SDIO_SLC_FRHOST_BIT10_INT_ENA1_S)
#define SDIO_SLC_FRHOST_BIT10_INT_ENA1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT10_INT_ENA1_S  2
/** SDIO_SLC_FRHOST_BIT11_INT_ENA1 : R/W; bitpos: [3]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT11_INT_ENA1    (BIT(3))
#define SDIO_SLC_FRHOST_BIT11_INT_ENA1_M  (SDIO_SLC_FRHOST_BIT11_INT_ENA1_V << SDIO_SLC_FRHOST_BIT11_INT_ENA1_S)
#define SDIO_SLC_FRHOST_BIT11_INT_ENA1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT11_INT_ENA1_S  3
/** SDIO_SLC_FRHOST_BIT12_INT_ENA1 : R/W; bitpos: [4]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT12_INT_ENA1    (BIT(4))
#define SDIO_SLC_FRHOST_BIT12_INT_ENA1_M  (SDIO_SLC_FRHOST_BIT12_INT_ENA1_V << SDIO_SLC_FRHOST_BIT12_INT_ENA1_S)
#define SDIO_SLC_FRHOST_BIT12_INT_ENA1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT12_INT_ENA1_S  4
/** SDIO_SLC_FRHOST_BIT13_INT_ENA1 : R/W; bitpos: [5]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT13_INT_ENA1    (BIT(5))
#define SDIO_SLC_FRHOST_BIT13_INT_ENA1_M  (SDIO_SLC_FRHOST_BIT13_INT_ENA1_V << SDIO_SLC_FRHOST_BIT13_INT_ENA1_S)
#define SDIO_SLC_FRHOST_BIT13_INT_ENA1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT13_INT_ENA1_S  5
/** SDIO_SLC_FRHOST_BIT14_INT_ENA1 : R/W; bitpos: [6]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT14_INT_ENA1    (BIT(6))
#define SDIO_SLC_FRHOST_BIT14_INT_ENA1_M  (SDIO_SLC_FRHOST_BIT14_INT_ENA1_V << SDIO_SLC_FRHOST_BIT14_INT_ENA1_S)
#define SDIO_SLC_FRHOST_BIT14_INT_ENA1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT14_INT_ENA1_S  6
/** SDIO_SLC_FRHOST_BIT15_INT_ENA1 : R/W; bitpos: [7]; default: 0;
 *  reserved
 */
#define SDIO_SLC_FRHOST_BIT15_INT_ENA1    (BIT(7))
#define SDIO_SLC_FRHOST_BIT15_INT_ENA1_M  (SDIO_SLC_FRHOST_BIT15_INT_ENA1_V << SDIO_SLC_FRHOST_BIT15_INT_ENA1_S)
#define SDIO_SLC_FRHOST_BIT15_INT_ENA1_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT15_INT_ENA1_S  7
/** SDIO_SLC1_RX_START_INT_ENA1 : R/W; bitpos: [8]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_START_INT_ENA1    (BIT(8))
#define SDIO_SLC1_RX_START_INT_ENA1_M  (SDIO_SLC1_RX_START_INT_ENA1_V << SDIO_SLC1_RX_START_INT_ENA1_S)
#define SDIO_SLC1_RX_START_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_RX_START_INT_ENA1_S  8
/** SDIO_SLC1_TX_START_INT_ENA1 : R/W; bitpos: [9]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_START_INT_ENA1    (BIT(9))
#define SDIO_SLC1_TX_START_INT_ENA1_M  (SDIO_SLC1_TX_START_INT_ENA1_V << SDIO_SLC1_TX_START_INT_ENA1_S)
#define SDIO_SLC1_TX_START_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_TX_START_INT_ENA1_S  9
/** SDIO_SLC1_RX_UDF_INT_ENA1 : R/W; bitpos: [10]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_UDF_INT_ENA1    (BIT(10))
#define SDIO_SLC1_RX_UDF_INT_ENA1_M  (SDIO_SLC1_RX_UDF_INT_ENA1_V << SDIO_SLC1_RX_UDF_INT_ENA1_S)
#define SDIO_SLC1_RX_UDF_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_RX_UDF_INT_ENA1_S  10
/** SDIO_SLC1_TX_OVF_INT_ENA1 : R/W; bitpos: [11]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_OVF_INT_ENA1    (BIT(11))
#define SDIO_SLC1_TX_OVF_INT_ENA1_M  (SDIO_SLC1_TX_OVF_INT_ENA1_V << SDIO_SLC1_TX_OVF_INT_ENA1_S)
#define SDIO_SLC1_TX_OVF_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_TX_OVF_INT_ENA1_S  11
/** SDIO_SLC1_TOKEN0_1TO0_INT_ENA1 : R/W; bitpos: [12]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN0_1TO0_INT_ENA1    (BIT(12))
#define SDIO_SLC1_TOKEN0_1TO0_INT_ENA1_M  (SDIO_SLC1_TOKEN0_1TO0_INT_ENA1_V << SDIO_SLC1_TOKEN0_1TO0_INT_ENA1_S)
#define SDIO_SLC1_TOKEN0_1TO0_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_TOKEN0_1TO0_INT_ENA1_S  12
/** SDIO_SLC1_TOKEN1_1TO0_INT_ENA1 : R/W; bitpos: [13]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN1_1TO0_INT_ENA1    (BIT(13))
#define SDIO_SLC1_TOKEN1_1TO0_INT_ENA1_M  (SDIO_SLC1_TOKEN1_1TO0_INT_ENA1_V << SDIO_SLC1_TOKEN1_1TO0_INT_ENA1_S)
#define SDIO_SLC1_TOKEN1_1TO0_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_TOKEN1_1TO0_INT_ENA1_S  13
/** SDIO_SLC1_TX_DONE_INT_ENA1 : R/W; bitpos: [14]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_DONE_INT_ENA1    (BIT(14))
#define SDIO_SLC1_TX_DONE_INT_ENA1_M  (SDIO_SLC1_TX_DONE_INT_ENA1_V << SDIO_SLC1_TX_DONE_INT_ENA1_S)
#define SDIO_SLC1_TX_DONE_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_TX_DONE_INT_ENA1_S  14
/** SDIO_SLC1_TX_SUC_EOF_INT_ENA1 : R/W; bitpos: [15]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_SUC_EOF_INT_ENA1    (BIT(15))
#define SDIO_SLC1_TX_SUC_EOF_INT_ENA1_M  (SDIO_SLC1_TX_SUC_EOF_INT_ENA1_V << SDIO_SLC1_TX_SUC_EOF_INT_ENA1_S)
#define SDIO_SLC1_TX_SUC_EOF_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_TX_SUC_EOF_INT_ENA1_S  15
/** SDIO_SLC1_RX_DONE_INT_ENA1 : R/W; bitpos: [16]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_DONE_INT_ENA1    (BIT(16))
#define SDIO_SLC1_RX_DONE_INT_ENA1_M  (SDIO_SLC1_RX_DONE_INT_ENA1_V << SDIO_SLC1_RX_DONE_INT_ENA1_S)
#define SDIO_SLC1_RX_DONE_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_RX_DONE_INT_ENA1_S  16
/** SDIO_SLC1_RX_EOF_INT_ENA1 : R/W; bitpos: [17]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_EOF_INT_ENA1    (BIT(17))
#define SDIO_SLC1_RX_EOF_INT_ENA1_M  (SDIO_SLC1_RX_EOF_INT_ENA1_V << SDIO_SLC1_RX_EOF_INT_ENA1_S)
#define SDIO_SLC1_RX_EOF_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_RX_EOF_INT_ENA1_S  17
/** SDIO_SLC1_TOHOST_INT_ENA1 : R/W; bitpos: [18]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOHOST_INT_ENA1    (BIT(18))
#define SDIO_SLC1_TOHOST_INT_ENA1_M  (SDIO_SLC1_TOHOST_INT_ENA1_V << SDIO_SLC1_TOHOST_INT_ENA1_S)
#define SDIO_SLC1_TOHOST_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_TOHOST_INT_ENA1_S  18
/** SDIO_SLC1_TX_DSCR_ERR_INT_ENA1 : R/W; bitpos: [19]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_DSCR_ERR_INT_ENA1    (BIT(19))
#define SDIO_SLC1_TX_DSCR_ERR_INT_ENA1_M  (SDIO_SLC1_TX_DSCR_ERR_INT_ENA1_V << SDIO_SLC1_TX_DSCR_ERR_INT_ENA1_S)
#define SDIO_SLC1_TX_DSCR_ERR_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_ERR_INT_ENA1_S  19
/** SDIO_SLC1_RX_DSCR_ERR_INT_ENA1 : R/W; bitpos: [20]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_DSCR_ERR_INT_ENA1    (BIT(20))
#define SDIO_SLC1_RX_DSCR_ERR_INT_ENA1_M  (SDIO_SLC1_RX_DSCR_ERR_INT_ENA1_V << SDIO_SLC1_RX_DSCR_ERR_INT_ENA1_S)
#define SDIO_SLC1_RX_DSCR_ERR_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_RX_DSCR_ERR_INT_ENA1_S  20
/** SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA1 : R/W; bitpos: [21]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA1    (BIT(21))
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA1_M  (SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA1_V << SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA1_S)
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA1_S  21
/** SDIO_SLC1_HOST_RD_ACK_INT_ENA1 : R/W; bitpos: [22]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_HOST_RD_ACK_INT_ENA1    (BIT(22))
#define SDIO_SLC1_HOST_RD_ACK_INT_ENA1_M  (SDIO_SLC1_HOST_RD_ACK_INT_ENA1_V << SDIO_SLC1_HOST_RD_ACK_INT_ENA1_S)
#define SDIO_SLC1_HOST_RD_ACK_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_HOST_RD_ACK_INT_ENA1_S  22
/** SDIO_SLC1_WR_RETRY_DONE_INT_ENA1 : R/W; bitpos: [23]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_WR_RETRY_DONE_INT_ENA1    (BIT(23))
#define SDIO_SLC1_WR_RETRY_DONE_INT_ENA1_M  (SDIO_SLC1_WR_RETRY_DONE_INT_ENA1_V << SDIO_SLC1_WR_RETRY_DONE_INT_ENA1_S)
#define SDIO_SLC1_WR_RETRY_DONE_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_WR_RETRY_DONE_INT_ENA1_S  23
/** SDIO_SLC1_TX_ERR_EOF_INT_ENA1 : R/W; bitpos: [24]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_ERR_EOF_INT_ENA1    (BIT(24))
#define SDIO_SLC1_TX_ERR_EOF_INT_ENA1_M  (SDIO_SLC1_TX_ERR_EOF_INT_ENA1_V << SDIO_SLC1_TX_ERR_EOF_INT_ENA1_S)
#define SDIO_SLC1_TX_ERR_EOF_INT_ENA1_V  0x00000001U
#define SDIO_SLC1_TX_ERR_EOF_INT_ENA1_S  24

/** SDIO_SLC0_TX_SHAREMEM_START_REG register
 *  reserved
 */
#define SDIO_SLC0_TX_SHAREMEM_START_REG (DR_REG_SLC_BASE + 0x154)
/** SDIO_SDIO_SLC0_TX_SHAREMEM_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SDIO_SLC0_TX_SHAREMEM_START_ADDR    0xFFFFFFFFU
#define SDIO_SDIO_SLC0_TX_SHAREMEM_START_ADDR_M  (SDIO_SDIO_SLC0_TX_SHAREMEM_START_ADDR_V << SDIO_SDIO_SLC0_TX_SHAREMEM_START_ADDR_S)
#define SDIO_SDIO_SLC0_TX_SHAREMEM_START_ADDR_V  0xFFFFFFFFU
#define SDIO_SDIO_SLC0_TX_SHAREMEM_START_ADDR_S  0

/** SDIO_SLC0_TX_SHAREMEM_END_REG register
 *  reserved
 */
#define SDIO_SLC0_TX_SHAREMEM_END_REG (DR_REG_SLC_BASE + 0x158)
/** SDIO_SDIO_SLC0_TX_SHAREMEM_END_ADDR : R/W; bitpos: [31:0]; default: 4294967295;
 *  reserved
 */
#define SDIO_SDIO_SLC0_TX_SHAREMEM_END_ADDR    0xFFFFFFFFU
#define SDIO_SDIO_SLC0_TX_SHAREMEM_END_ADDR_M  (SDIO_SDIO_SLC0_TX_SHAREMEM_END_ADDR_V << SDIO_SDIO_SLC0_TX_SHAREMEM_END_ADDR_S)
#define SDIO_SDIO_SLC0_TX_SHAREMEM_END_ADDR_V  0xFFFFFFFFU
#define SDIO_SDIO_SLC0_TX_SHAREMEM_END_ADDR_S  0

/** SDIO_SLC0_RX_SHAREMEM_START_REG register
 *  reserved
 */
#define SDIO_SLC0_RX_SHAREMEM_START_REG (DR_REG_SLC_BASE + 0x15c)
/** SDIO_SDIO_SLC0_RX_SHAREMEM_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SDIO_SLC0_RX_SHAREMEM_START_ADDR    0xFFFFFFFFU
#define SDIO_SDIO_SLC0_RX_SHAREMEM_START_ADDR_M  (SDIO_SDIO_SLC0_RX_SHAREMEM_START_ADDR_V << SDIO_SDIO_SLC0_RX_SHAREMEM_START_ADDR_S)
#define SDIO_SDIO_SLC0_RX_SHAREMEM_START_ADDR_V  0xFFFFFFFFU
#define SDIO_SDIO_SLC0_RX_SHAREMEM_START_ADDR_S  0

/** SDIO_SLC0_RX_SHAREMEM_END_REG register
 *  reserved
 */
#define SDIO_SLC0_RX_SHAREMEM_END_REG (DR_REG_SLC_BASE + 0x160)
/** SDIO_SDIO_SLC0_RX_SHAREMEM_END_ADDR : R/W; bitpos: [31:0]; default: 4294967295;
 *  reserved
 */
#define SDIO_SDIO_SLC0_RX_SHAREMEM_END_ADDR    0xFFFFFFFFU
#define SDIO_SDIO_SLC0_RX_SHAREMEM_END_ADDR_M  (SDIO_SDIO_SLC0_RX_SHAREMEM_END_ADDR_V << SDIO_SDIO_SLC0_RX_SHAREMEM_END_ADDR_S)
#define SDIO_SDIO_SLC0_RX_SHAREMEM_END_ADDR_V  0xFFFFFFFFU
#define SDIO_SDIO_SLC0_RX_SHAREMEM_END_ADDR_S  0

